tutorials/fluid/hotRadiationRoomFvDOM/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi        3;      // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      5;      // polar angles in PI (from Z to X-Y plane)
    tolerance   1e-3;   // convergence tolerance for radiation iteration
    maxIter     10;     // maximum number of iterations
}

// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel constant;

constantCoeffs
{
   absorptivity    0.5;
   emissivity      0.5;
   E               0;
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
